In [4]:
import pandas as pd
import numpy as np

In [3]:
print(pd.__version__)

1.3.4

In [17]:
a=pd.DataFrame([1,2,3],[1,23,3])
a

    0
1   1
23  2
3   3

In [26]:

c=pd.DataFrame([[1,2,3],[1,23,3],[1,2,3]])

c

   0   1  2
0  1   2  3
1  1  23  3
2  1   2  3

# 1.SERIES

In [3]:
list=[1,2,3,4,5]
label=['a','b','c','d','e']

In [4]:
list

[1, 2, 3, 4, 5]

In [5]:
import pandas as pd
ser=pd.Series(list)
ser

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
ser=pd.Series(list,index=label)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

#main diff btw numpy array and pandas series is 
#in pandas we can change theidexes but not in numpy array

In [7]:
ser['b']

2

In [8]:
marks={"maths":12,"sci":32,"phy":31}
ser=pd.Series(marks)
ser

maths    12
sci      32
phy      31
dtype: int64

In [9]:
marks={"maths":12,"sci":32,"phy":31}
ser=pd.Series(marks,index=["maths","sci"])
ser

maths    12
sci      32
dtype: int64

# series indexing

In [10]:
ser

maths    12
sci      32
dtype: int64

In [11]:
ser[1]

32

In [12]:
ser["maths"]

12

# slicing

In [13]:
ser[0:2]

maths    12
sci      32
dtype: int64

In [14]:
ser.shape

(2,)

In [15]:
type(ser)

pandas.core.series.Series

# DATA FRAME

In [49]:
list=[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]
df=pd.DataFrame(list)
df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [51]:
df[0:1,1:3]

KeyError: (slice(0, 1, None), slice(1, 3, None))

In [29]:
list=[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]
col=["a","b","c","d"]
row=['A','B','C','D']
df=pd.DataFrame(list, index=row,columns=col)
df

    a   b   c   d
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16

In [30]:
df=pd.DataFrame({"name":["a",'b','c',"d"],'age':[1,2,3,4],'branch':['A','S','D','E']},index=[2,3,4,5] )
df

  name  age branch
2    a    1      A
3    b    2      S
4    c    3      D
5    d    4      E

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df.shape

(4, 3)

In [33]:
df.columns

Index(['name', 'age', 'branch'], dtype='object')

In [34]:
df1=df.rename(columns={"name":"new_name"})
df1

  new_name  age branch
2        a    1      A
3        b    2      S
4        c    3      D
5        d    4      E

In [35]:
df1.index[[0,1]]

Int64Index([2, 3], dtype='int64')

In [36]:
df1.columns[[1,2]]

Index(['age', 'branch'], dtype='object')

In [37]:



df1.columns.values

array(['new_name', 'age', 'branch'], dtype=object)

In [41]:
df1.columns.values[2]

'branch'

In [27]:
df1.columns.values[2]="new-branch"
df1

  new_name  age new-branch
0        a    1          A
1        b    2          S
2        c    3          D
3        d    4          E

In [28]:
df1.index.values

array([0, 1, 2, 3], dtype=int64)

In [29]:
df1

  new_name  age new-branch
0        a    1          A
1        b    2          S
2        c    3          D
3        d    4          E

In [42]:
df.drop("name",axis=1) # drooping colummn

   age branch
2    1      A
3    2      S
4    3      D
5    4      E

In [43]:
df

  name  age branch
2    a    1      A
3    b    2      S
4    c    3      D
5    d    4      E

In [47]:
df.drop("age",axis=1,inplace=True)
df

  name
3    b
4    c
5    d

In [33]:
df

  name branch
0    a      A
1    b      S
2    c      D
3    d      E

In [34]:
df["place"]=["hyd","vjy", 'bkk',"ap"]   #adding column

In [35]:
df

  name branch place
0    a      A   hyd
1    b      S   vjy
2    c      D   bkk
3    d      E    ap

In [36]:
df=pd.DataFrame({"name":["a",'b','c',"d"],'age':[1,2,3,4],'branch':['A','S','D','E']})
df1=pd.DataFrame({"name":["A",'B','C',"D"],'age':[1,2,3,4],'branch':['A','S','D','E'],"place":["hyd","vjy", 'bkk',"ap"] })

In [37]:
df3=df.append(df1)               #concatinatig 2 dataframes
df3

  name  age branch place
0    a    1      A   NaN
1    b    2      S   NaN
2    c    3      D   NaN
3    d    4      E   NaN
0    A    1      A   hyd
1    B    2      S   vjy
2    C    3      D   bkk
3    D    4      E    ap

In [38]:
df2=pd.concat([df,df1])

In [39]:
df2

  name  age branch place
0    a    1      A   NaN
1    b    2      S   NaN
2    c    3      D   NaN
3    d    4      E   NaN
0    A    1      A   hyd
1    B    2      S   vjy
2    C    3      D   bkk
3    D    4      E    ap

In [40]:
df3=df.append(df1 , ignore_index="True") 
df3

  name  age branch place
0    a    1      A   NaN
1    b    2      S   NaN
2    c    3      D   NaN
3    d    4      E   NaN
4    A    1      A   hyd
5    B    2      S   vjy
6    C    3      D   bkk
7    D    4      E    ap

# Handle missing values

1. delete the rows, or column
2.imputing the values

# 1000 records total
if 12 records is null ....delete rows 12
if 800 records is null ....delete that column

In [41]:
df3

  name  age branch place
0    a    1      A   NaN
1    b    2      S   NaN
2    c    3      D   NaN
3    d    4      E   NaN
4    A    1      A   hyd
5    B    2      S   vjy
6    C    3      D   bkk
7    D    4      E    ap

In [42]:
df3.isnull()

    name    age  branch  place
0  False  False   False   True
1  False  False   False   True
2  False  False   False   True
3  False  False   False   True
4  False  False   False  False
5  False  False   False  False
6  False  False   False  False
7  False  False   False  False

In [43]:
df3.isnull().any()

name      False
age       False
branch    False
place      True
dtype: bool

In [44]:
df3.isnull().sum()

name      0
age       0
branch    0
place     4
dtype: int64

In [45]:
#deleting the rows containing null
df1.dropna()

  name  age branch place
0    A    1      A   hyd
1    B    2      S   vjy
2    C    3      D   bkk
3    D    4      E    ap

In [46]:
df3

  name  age branch place
0    a    1      A   NaN
1    b    2      S   NaN
2    c    3      D   NaN
3    d    4      E   NaN
4    A    1      A   hyd
5    B    2      S   vjy
6    C    3      D   bkk
7    D    4      E    ap

In [47]:
df3.dropna(inplace=True)
df3

  name  age branch place
4    A    1      A   hyd
5    B    2      S   vjy
6    C    3      D   bkk
7    D    4      E    ap

In [48]:
df2

  name  age branch place
0    a    1      A   NaN
1    b    2      S   NaN
2    c    3      D   NaN
3    d    4      E   NaN
0    A    1      A   hyd
1    B    2      S   vjy
2    C    3      D   bkk
3    D    4      E    ap

In [49]:
#delete the columns
df2.dropna(axis=1,inplace=True)

In [50]:
df2

  name  age branch
0    a    1      A
1    b    2      S
2    c    3      D
3    d    4      E
0    A    1      A
1    B    2      S
2    C    3      D
3    D    4      E

In [51]:
#imputing

In [52]:

df=pd.DataFrame({"name":["a",'b','c',"d"],'age':[1,2,3,4],'branch':['A','S','D','E']})
df1=pd.DataFrame({"name":["A",'B','C',"D"],'age':[1,2,3,4],'branch':['A','S','D','E'],"rate":[1,12,3,3] })
dff=pd.concat([df,df1])
dff

  name  age branch  rate
0    a    1      A   NaN
1    b    2      S   NaN
2    c    3      D   NaN
3    d    4      E   NaN
0    A    1      A   1.0
1    B    2      S  12.0
2    C    3      D   3.0
3    D    4      E   3.0

In [53]:
dff["rate"]=dff["rate"].fillna(dff["rate"].mean())

In [54]:
dff

  name  age branch   rate
0    a    1      A   4.75
1    b    2      S   4.75
2    c    3      D   4.75
3    d    4      E   4.75
0    A    1      A   1.00
1    B    2      S  12.00
2    C    3      D   3.00
3    D    4      E   3.00

In [55]:
dff["rate"]=dff["rate"].fillna(dff["rate"].median())
dff

  name  age branch   rate
0    a    1      A   4.75
1    b    2      S   4.75
2    c    3      D   4.75
3    d    4      E   4.75
0    A    1      A   1.00
1    B    2      S  12.00
2    C    3      D   3.00
3    D    4      E   3.00

In [56]:
dff["rate"]=dff["rate"].fillna(dff["rate"].mode())
dff

  name  age branch   rate
0    a    1      A   4.75
1    b    2      S   4.75
2    c    3      D   4.75
3    d    4      E   4.75
0    A    1      A   1.00
1    B    2      S  12.00
2    C    3      D   3.00
3    D    4      E   3.00

In [57]:
import pandas as pd
df=pd.DataFrame({"name":["a",'b','c',"d"],'age':[1,2,3,4],'branch':['A','S','D','E']})
df1=pd.DataFrame({"name":["A",'B','C',"D"],'age':[1,2,3,4],'branch':['A','S','D','E'],"place":["vjy","vjy", 'ap',"ap"] })
dff=pd.concat([df,df1])
dff

  name  age branch place
0    a    1      A   NaN
1    b    2      S   NaN
2    c    3      D   NaN
3    d    4      E   NaN
0    A    1      A   vjy
1    B    2      S   vjy
2    C    3      D    ap
3    D    4      E    ap

In [58]:
dff["place"]=dff["place"].fillna(dff["place"].mode()[0])
dff

  name  age branch place
0    a    1      A    ap
1    b    2      S    ap
2    c    3      D    ap
3    d    4      E    ap
0    A    1      A   vjy
1    B    2      S   vjy
2    C    3      D    ap
3    D    4      E    ap

In [59]:
dff.place.value_counts()

ap     6
vjy    2
Name: place, dtype: int64

In [60]:
group=dff.groupby("name")
group

In [61]:
group.mean()

      age
name
A     1.0
B     2.0
C     3.0
D     4.0
a     1.0
b     2.0
c     3.0
d     4.0

In [62]:
dff.shape

(8, 4)

In [63]:


dff.head(2)

  name  age branch place
0    a    1      A    ap
1    b    2      S    ap

In [64]:
dff.tail()

  name  age branch place
3    d    4      E    ap
0    A    1      A   vjy
1    B    2      S   vjy
2    C    3      D    ap
3    D    4      E    ap

loc .......labelled indexes 
ioc........integer based indexes

In [65]:
df=pd.DataFrame({"name":["a",'b','c',"d"],'age':[1,2,3,4],'branch':['A','S','D','E']})
df

  name  age branch
0    a    1      A
1    b    2      S
2    c    3      D
3    d    4      E

In [66]:
df1=df.loc[0]
df1

name      a
age       1
branch    A
Name: 0, dtype: object

In [67]:
type(df1)

pandas.core.series.Series

In [68]:
df.loc[0:2]

  name  age branch
0    a    1      A
1    b    2      S
2    c    3      D

In [69]:
df.loc[:,["name","branch"]]

  name branch
0    a      A
1    b      S
2    c      D
3    d      E

In [75]:
df.iloc[1:3,1:3]

   age branch
1    2      S
2    3      D

In [73]:
df.columns.value_counts()

name      1
age       1
branch    1
dtype: int64